## repositories plan
```
module.test-repo-levg.github_repository.default: Refreshing state... [id=test-repo-levg]
module.github-collaborators.github_repository.default: Refreshing state... [id=github-collaborators]
module.template-documentation-site.github_repository.default: Refreshing state... [id=template-documentation-site]
module.operations-engineering-devcontainer.github_repository.default: Refreshing state... [id=operations-engineering-devcontainer]
module.github.github_repository.default: Refreshing state... [id=.github]
module.operations-engineering-certificate-renewal.github_repository.default: Refreshing state... [id=operations-engineering-certificate-renewal]
module.operations-engineering-runbooks.github_repository.default: Refreshing state... [id=operations-engineering-runbooks]
module.moj-terraform-aws-sso.github_repository.default: Refreshing state... [id=moj-terraform-aws-sso]
module.template-repository.github_repository.default: Refreshing state... [id=template-repository]
module.tech-docs-github-pages-publisher.github_repository.default: Refreshing state... [id=tech-docs-github-pages-publisher]
module.operations-engineering-user-guide.github_repository.default: Refreshing state... [id=operations-engineering-user-guide]
module.moj-terraform-scim-github.github_repository.default: Refreshing state... [id=moj-terraform-scim-github]
module.operations-engineering-metadata-poc.github_repository.default: Refreshing state... [id=operations-engineering-metadata-poc]
module.terraform-aws-mtasts.github_repository.default: Refreshing state... [id=terraform-aws-mtasts]
module.operations-engineering-example.github_repository.default: Refreshing state... [id=operations-engineering-example]
module.terraform-template-poc.github_repository.default: Refreshing state... [id=terraform-template-poc]
module.acronyms.github_repository.default: Refreshing state... [id=acronyms]
module.technical-guidance.github_repository.default: Refreshing state... [id=technical-guidance]
module.github-actions.github_repository.default: Refreshing state... [id=github-actions]
module.terraform-github-repository.github_repository.default: Refreshing state... [id=terraform-github-repository]
module.operations-engineering.github_repository.default: Refreshing state... [id=operations-engineering]
module.operations-engineering-reports.github_repository.default: Refreshing state... [id=operations-engineering-reports]
module.operations-engineering-join-github.github_repository.default: Refreshing state... [id=operations-engineering-join-github]
module.tech-docs-monitor.github_repository.default: Refreshing state... [id=tech-docs-monitor]
module.operations-engineering-documentation-browser-extension.github_repository.default: Refreshing state... [id=operations-engineering-documentation-browser-extension]
module.cloud-platform-maintenance-pages.github_repository.default: Refreshing state... [id=cloud-platform-maintenance-pages]
module.test-repo-levg.github_branch_protection.default: Refreshing state... [id=BPR_kwDOLPRAVc4CyGYH]
module.test-repo-levg.data.github_actions_public_key.default: Reading...
module.test-repo-levg.github_repository_tag_protection.default: Refreshing state... [id=168994]
module.operations-engineering-devcontainer.github_repository_tag_protection.default: Refreshing state... [id=164706]
module.operations-engineering-devcontainer.github_branch_protection.default: Refreshing state... [id=BPR_kwDOLCkQts4Cv-3X]
module.operations-engineering-devcontainer.data.github_actions_public_key.default: Reading...
module.github.github_repository_tag_protection.default: Refreshing state... [id=164900]
module.github.github_branch_protection.default: Refreshing state... [id=BPR_kwDOFbeyoM4CwGtg]
module.github.data.github_actions_public_key.default: Reading...
module.template-documentation-site.github_branch_protection.default: Refreshing state... [id=BPR_kwDOEQGgTs4CwPiI]
module.template-documentation-site.data.github_actions_public_key.default: Reading...
module.test-repo-levg.data.github_actions_public_key.default: Read complete after 1s [id=3380204578043523366]
module.template-documentation-site.github_repository_tag_protection.default: Refreshing state... [id=165193]
module.template-repository.data.github_actions_public_key.default: Reading...
module.template-repository.github_repository_tag_protection.default: Refreshing state... [id=165191]
module.template-repository.github_branch_protection.default: Refreshing state... [id=BPR_kwDODYkhA84CwPiC]
module.operations-engineering-devcontainer.data.github_actions_public_key.default: Read complete after 2s [id=3380204578043523366]
module.operations-engineering-certificate-renewal.data.github_actions_public_key.default: Reading...
module.operations-engineering-certificate-renewal.github_repository_tag_protection.default: Refreshing state... [id=165171]
module.operations-engineering-certificate-renewal.github_branch_protection.default: Refreshing state... [id=BPR_kwDOI-Hjhc4CwPF_]
module.github.data.github_actions_public_key.default: Read complete after 3s [id=3380204578043523366]
module.tech-docs-github-pages-publisher.github_branch_protection.default: Refreshing state... [id=BPR_kwDOE7RAx84CwPh_]
module.tech-docs-github-pages-publisher.github_repository_tag_protection.default: Refreshing state... [id=165187]
module.template-documentation-site.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.tech-docs-github-pages-publisher.data.github_actions_public_key.default: Reading...
module.moj-terraform-aws-sso.data.github_actions_public_key.default: Reading...
module.template-repository.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.moj-terraform-aws-sso.github_repository_tag_protection.default: Refreshing state... [id=164896]
module.moj-terraform-aws-sso.github_branch_protection.default: Refreshing state... [id=BPR_kwDOEYOl7c4CwGtj]
module.github-collaborators.data.github_actions_public_key.default: Reading...
module.operations-engineering-certificate-renewal.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.github-collaborators.github_repository_tag_protection.default: Refreshing state... [id=164898]
module.github-collaborators.github_branch_protection.default: Refreshing state... [id=BPR_kwDOEoQScc4CwGtd]
module.operations-engineering-user-guide.github_branch_protection.default: Refreshing state... [id=BPR_kwDOKCGhm84CwPGO]
module.operations-engineering-user-guide.data.github_actions_public_key.default: Reading...
module.operations-engineering-user-guide.github_repository_tag_protection.default: Refreshing state... [id=165176]
module.tech-docs-github-pages-publisher.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.moj-terraform-scim-github.github_repository_tag_protection.default: Refreshing state... [id=164897]
module.moj-terraform-aws-sso.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.moj-terraform-scim-github.github_branch_protection.default: Refreshing state... [id=BPR_kwDOEoPJ8s4CwGtf]
module.moj-terraform-scim-github.data.github_actions_public_key.default: Reading...
module.operations-engineering-metadata-poc.github_repository_tag_protection.default: Refreshing state... [id=165174]
module.github-collaborators.data.github_actions_public_key.default: Read complete after 6s [id=3380204578043523366]
module.operations-engineering-metadata-poc.data.github_actions_public_key.default: Reading...
module.operations-engineering-metadata-poc.github_actions_variable.default["DEVELOPMENT_ECR_REPOSITORY"]: Refreshing state... [id=operations-engineering-metadata-poc:DEVELOPMENT_ECR_REPOSITORY]
module.operations-engineering-metadata-poc.github_actions_variable.default["ECR_REGISTRY"]: Refreshing state... [id=operations-engineering-metadata-poc:ECR_REGISTRY]
module.operations-engineering-metadata-poc.github_actions_variable.default["DEVELOPMENT_ECR_REGION"]: Refreshing state... [id=operations-engineering-metadata-poc:DEVELOPMENT_ECR_REGION]
module.operations-engineering-user-guide.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.operations-engineering-metadata-poc.github_branch_protection.default: Refreshing state... [id=BPR_kwDOKeC3Jc4CwPGL]
module.terraform-aws-mtasts.github_repository_tag_protection.default: Refreshing state... [id=165192]
module.terraform-aws-mtasts.github_branch_protection.default: Refreshing state... [id=BPR_kwDOHWUugs4CwPiH]
module.terraform-aws-mtasts.data.github_actions_public_key.default: Reading...
module.moj-terraform-scim-github.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.acronyms.github_repository_tag_protection.default: Refreshing state... [id=164902]
module.acronyms.data.github_actions_public_key.default: Reading...
module.operations-engineering-metadata-poc.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.acronyms.github_branch_protection.default: Refreshing state... [id=BPR_kwDODR2mI84CwGtl]
module.operations-engineering-reports.data.github_actions_public_key.default: Reading...
module.operations-engineering-reports.github_repository_tag_protection.default: Refreshing state... [id=165169]
module.operations-engineering-reports.github_actions_variable.default["ECR_REGISTRY"]: Refreshing state... [id=operations-engineering-reports:ECR_REGISTRY]
module.operations-engineering-reports.github_actions_variable.default["DEVELOPMENT_ECR_REPOSITORY"]: Refreshing state... [id=operations-engineering-reports:DEVELOPMENT_ECR_REPOSITORY]
module.operations-engineering-reports.github_actions_variable.default["DEVELOPMENT_ECR_REGION"]: Refreshing state... [id=operations-engineering-reports:DEVELOPMENT_ECR_REGION]
module.operations-engineering-reports.github_actions_variable.default["PRODUCTION_ECR_REGION"]: Refreshing state... [id=operations-engineering-reports:PRODUCTION_ECR_REGION]
module.terraform-aws-mtasts.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.operations-engineering-reports.github_actions_variable.default["PRODUCTION_ECR_REPOSITORY"]: Refreshing state... [id=operations-engineering-reports:PRODUCTION_ECR_REPOSITORY]
module.operations-engineering-reports.github_branch_protection.default: Refreshing state... [id=BPR_kwDOEpRCis4CwPF-]
module.acronyms.data.github_actions_public_key.default: Read complete after 3s [id=3380204578043523366]
module.operations-engineering-example.data.github_actions_public_key.default: Reading...
module.operations-engineering-example.github_repository_tag_protection.default: Refreshing state... [id=165173]
module.operations-engineering-reports.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.operations-engineering-example.github_branch_protection.default: Refreshing state... [id=BPR_kwDOKnX9OM4CwPGH]
module.operations-engineering-example.github_actions_variable.default["PRODUCTION_ECR_REGION"]: Refreshing state... [id=operations-engineering-example:PRODUCTION_ECR_REGION]
module.operations-engineering-example.github_actions_variable.default["DEVELOPMENT_ECR_REGION"]: Refreshing state... [id=operations-engineering-example:DEVELOPMENT_ECR_REGION]
module.operations-engineering-example.github_actions_variable.default["DEVELOPMENT_ECR_REPOSITORY"]: Refreshing state... [id=operations-engineering-example:DEVELOPMENT_ECR_REPOSITORY]
module.operations-engineering-example.github_actions_variable.default["PRODUCTION_ECR_REPOSITORY"]: Refreshing state... [id=operations-engineering-example:PRODUCTION_ECR_REPOSITORY]
module.operations-engineering-runbooks.github_branch_protection.default: Refreshing state... [id=BPR_kwDOKK8OCc4CwPGM]
module.operations-engineering-runbooks.data.github_actions_public_key.default: Reading...
module.operations-engineering-runbooks.github_repository_tag_protection.default: Refreshing state... [id=165175]
module.operations-engineering-example.data.github_actions_public_key.default: Read complete after 3s [id=3380204578043523366]
module.terraform-template-poc.data.github_actions_public_key.default: Reading...
module.terraform-template-poc.github_repository_tag_protection.default: Refreshing state... [id=165190]
module.terraform-template-poc.github_branch_protection.default: Refreshing state... [id=BPR_kwDOJKjnDs4CwPiD]
module.tech-docs-monitor.github_repository_tag_protection.default: Refreshing state... [id=165188]
module.tech-docs-monitor.github_branch_protection.default: Refreshing state... [id=BPR_kwDOHQFa_s4CwPiA]
module.tech-docs-monitor.data.github_actions_public_key.default: Reading...
module.terraform-github-repository.github_branch_protection.default: Refreshing state... [id=BPR_kwDOLELUgs4CwzoY]
module.terraform-github-repository.data.github_actions_public_key.default: Reading...
module.operations-engineering-runbooks.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.terraform-github-repository.github_repository_tag_protection.default: Refreshing state... [id=166200]
module.operations-engineering-documentation-browser-extension.github_repository_tag_protection.default: Refreshing state... [id=165168]
module.terraform-template-poc.data.github_actions_public_key.default: Read complete after 3s [id=3380204578043523366]
module.operations-engineering-documentation-browser-extension.data.github_actions_public_key.default: Reading...
module.operations-engineering-documentation-browser-extension.github_branch_protection.default: Refreshing state... [id=BPR_kwDOK636CM4CwPF8]
module.operations-engineering-join-github.github_repository_tag_protection.default: Refreshing state... [id=165170]
module.operations-engineering-join-github.github_branch_protection.default: Refreshing state... [id=BPR_kwDOKeC4ns4CwPGB]
module.operations-engineering-join-github.data.github_actions_public_key.default: Reading...
module.tech-docs-monitor.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.operations-engineering-join-github.github_actions_variable.default["DEV_ECR_REGION"]: Refreshing state... [id=operations-engineering-join-github:DEV_ECR_REGION]
module.operations-engineering-join-github.github_actions_variable.default["PROD_ECR_REGISTRY"]: Refreshing state... [id=operations-engineering-join-github:PROD_ECR_REGISTRY]
module.terraform-github-repository.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.operations-engineering-join-github.github_actions_variable.default["PROD_ECR_REGION"]: Refreshing state... [id=operations-engineering-join-github:PROD_ECR_REGION]
module.operations-engineering-join-github.github_actions_variable.default["PROD_ECR_REPOSITORY"]: Refreshing state... [id=operations-engineering-join-github:PROD_ECR_REPOSITORY]
module.operations-engineering-join-github.github_actions_variable.default["DEV_ECR_REGISTRY"]: Refreshing state... [id=operations-engineering-join-github:DEV_ECR_REGISTRY]
module.operations-engineering-documentation-browser-extension.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.operations-engineering-join-github.github_actions_variable.default["DEV_ECR_REPOSITORY"]: Refreshing state... [id=operations-engineering-join-github:DEV_ECR_REPOSITORY]
module.cloud-platform-maintenance-pages.github_repository_tag_protection.default: Refreshing state... [id=164899]
module.cloud-platform-maintenance-pages.github_branch_protection.default: Refreshing state... [id=BPR_kwDOEeVbDs4CwGth]
module.cloud-platform-maintenance-pages.data.github_actions_public_key.default: Reading...
module.operations-engineering-join-github.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.technical-guidance.data.github_actions_public_key.default: Reading...
module.technical-guidance.github_repository_tag_protection.default: Refreshing state... [id=165189]
module.technical-guidance.github_branch_protection.default: Refreshing state... [id=BPR_kwDOBeUD0s4CwPiB]
module.github-actions.github_branch_protection.default: Refreshing state... [id=BPR_kwDODNFKOs4CwGtk]
module.github-actions.github_repository_tag_protection.default: Refreshing state... [id=164901]
module.github-actions.data.github_actions_public_key.default: Reading...
module.operations-engineering.github_repository_tag_protection.default: Refreshing state... [id=165184]
module.operations-engineering.github_branch_protection.default: Refreshing state... [id=BPR_kwDODVCV0c4CwPYY]
module.operations-engineering.data.github_actions_public_key.default: Reading...
module.cloud-platform-maintenance-pages.data.github_actions_public_key.default: Read complete after 3s [id=3380204578043523366]
module.technical-guidance.data.github_actions_public_key.default: Read complete after 2s [id=3380204578043523366]
module.github-actions.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.operations-engineering.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.test-repo2-levg.data.github_actions_public_key.default will be read during apply
  # (config refers to values not yet known)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = (known after apply)
    }

  # module.test-repo2-levg.github_branch_protection.default will be created
  + resource "github_branch_protection" "default" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_code_owner_reviews      = true
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

      + required_status_checks {
          + strict = false
        }
    }

  # module.test-repo2-levg.github_repository.default will be created
  + resource "github_repository" "default" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archive_on_destroy          = true
      + archived                    = false
      + auto_init                   = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "test repo2 • This repository is defined and managed in Terraform"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_discussions             = false
      + has_downloads               = true
      + has_issues                  = true
      + has_projects                = true
      + has_wiki                    = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "test-repo2-levg"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "operations-engineering",
        ]
      + visibility                  = "public"
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false

      + security_and_analysis {
          + secret_scanning {
              + status = "enabled"
            }
          + secret_scanning_push_protection {
              + status = "enabled"
            }
        }

      + template {
          + include_all_branches = false
          + owner                = "ministryofjustice"
          + repository           = "template-repository"
        }
    }

  # module.test-repo2-levg.github_repository_tag_protection.default will be created
  + resource "github_repository_tag_protection" "default" {
      + id                = (known after apply)
      + pattern           = "*"
      + repository        = (known after apply)
      + tag_protection_id = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```